In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                  'k2':[1,1,2,3,3,4,4]})

In [3]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [4]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [5]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [6]:
data['v1']=range(7)

In [7]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [8]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [9]:
data2=pd.DataFrame({'food':['bacon','pulled pork','bacon',
                           'Pastrami','corned beef','Bacon',
                            'pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [11]:
data2

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [12]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [14]:
lowercased=data2['food'].str.lower()

In [15]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [16]:
data2['animal']=lowercased.map(meat_to_animal)

In [17]:
data2

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [19]:
data2['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [20]:
data3=pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [21]:
data3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [22]:
data3.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [23]:
data3.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [24]:
data3.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [25]:
data3.replace({-999: 0, -1000: np.nan})

0    1.0
1    0.0
2    2.0
3    0.0
4    NaN
5    3.0
dtype: float64

In [26]:
data4=pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=['Ohio','Colorado','New York'],
                  columns=['one', 'two','three','four'])

In [27]:
transform=lambda x:x[:4].upper()

In [29]:
data4.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [31]:
data4.index=data4.index.map(transform)

In [32]:
data4

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [33]:
data4.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [35]:
data4.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [36]:
data4

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [37]:
data5=data4.copy()

In [38]:
data5

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [39]:
data5.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [40]:
data5

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [41]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [42]:
bins=[18,25,35,60,100]

In [43]:
cats=pd.cut(ages, bins)

In [44]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [46]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [47]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [48]:
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [49]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [50]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [51]:
data6=np.random.rand(20)

In [52]:
pd.cut(data6, 4, precision=2)

[(0.00027, 0.21], (0.61, 0.82], (0.41, 0.61], (0.61, 0.82], (0.61, 0.82], ..., (0.21, 0.41], (0.61, 0.82], (0.21, 0.41], (0.41, 0.61], (0.21, 0.41]]
Length: 20
Categories (4, interval[float64]): [(0.00027, 0.21] < (0.21, 0.41] < (0.41, 0.61] < (0.61, 0.82]]

In [60]:
data7=np.random.randn(1000)

In [61]:
cats=pd.qcut(data7,4)

In [62]:
cats

[(-0.66, -0.03], (-3.452, -0.66], (-0.66, -0.03], (-0.03, 0.636], (0.636, 2.851], ..., (0.636, 2.851], (-3.452, -0.66], (-0.66, -0.03], (-0.66, -0.03], (0.636, 2.851]]
Length: 1000
Categories (4, interval[float64]): [(-3.452, -0.66] < (-0.66, -0.03] < (-0.03, 0.636] < (0.636, 2.851]]

In [63]:
pd.value_counts(cats)

(0.636, 2.851]     250
(-0.03, 0.636]     250
(-0.66, -0.03]     250
(-3.452, -0.66]    250
dtype: int64

In [65]:
cats2=pd.qcut(data7,[0,0.1,0.5,0.9,1.])

In [66]:
pd.value_counts(cats2)

(-0.03, 1.238]      400
(-1.206, -0.03]     400
(1.238, 2.851]      100
(-3.452, -1.206]    100
dtype: int64